[
  {
    "name": "task1",
    "description": "Найдите сумму площадей всех треугольников внутри звёздчатого многоугольника (6;2), если известно, что радиус описанной окружности равен 2.",
    "picture": "./pictures/task/sh.png",
    "answer": "6.93",
    "solve": "./pictures/ans/solve1.jpg",
    "solve2": ""
  },
  {
    "name": "task2",
    "description": "На рисунке изображена равнобедернная трапеция (боковая сторона меньше основания), угол у основания 250/3 градусов. Несколько таких же трапеций составили вместе, продливая праввую боковую сторону так, чтобы она стала основанием новой трапеции. Известно, что такой симметричный паттерн замкнётся в ЗМ. Сколько понадобится трапеций, чтобы закмкнуться в многоугольник? Является ли этот многоугольник звёздчатым, докажите это. Запишите полученные ответы через пробел.",
    "picture": "./pictures/task/task2.png",
    "answer": "54 нет",
    "solve": "./pictures/ans/solve2.jpg",
    "solve2": ""
  },
  {
    "name": "task3",
    "description": "Докажите подобие внутреннего многоугольника, который образовался внутри ЗМ к исходному многоугольнику, из которого посторен ЗМ.",
    "picture": "./pictures/task/sh.png",
    "answer": "",
    "solve": "./pictures/ans/solve3.jpg",
    "solve2": ""
  },
  {
    "name": "task4",
    "description": "Имеется ЗМ (6;2), посторенный в правильном шестиугольнике, около него описана окружность с радиусом 2. Найдите площадь ЗМ вписанного в шестиугольник внутри ЗМ.",
    "picture": "./pictures/task/sh.png",
    "answer": "0.53",
    "solve": "./pictures/ans/solve4.jpg",
    "solve2": ""
  },
  {
    "name": "task5",
    "description": "Найдите площадь треугольника АBC, если известно, что радиус, описанный вокруг ЗМ {6;2} равен 1.",
    "picture": "./pictures/task/task5.png",
    "answer": "0.29",
    "solve": "./pictures/ans/solve5.jpg",
    "solve2": ""
  },
  {
    "name": "task6",
    "description": "На рисунке пятиугольная звезда. Попробуй нарисовать ещё пару таких \"неправильных\" пятиугольных звёзд, какова сумма их внутренних углов?",
    "picture": "./pictures/task/sh.png",
    "answer": "180",
    "solve": "./pictures/ans/solve61.jpg",
    "solve2": "./pictures/ans/solve62.jpg"
  },
  {
    "name": "task7",
    "description": "Сколько звездчатых многоугольников можно нарисовать на окружности с помощью n равномерно расположенных точек? Запишите полученные значения в строчку без пробелов.",
    "picture": "./pictures/task/task7.png",
    "answer": "1122334455667",
    "solve": "./pictures/ans/solve7.png",
    "solve2": ""
  },
  {
    "name": "task8",
    "description": "Найдите величину угла для каждого звездчатого многоугольника, перечисленного ниже. Запишите полученные значения в строчку без пробелов.",
    "picture": "./pictures/task/task8.png",
    "answer": "3645203040",
    "solve": "./pictures/ans/solve8.png",
    "solve2": ""
  },
  {
    "name": "task9",
    "description": "Не рисуя, определите связность для каждого {n;m}, указанного ниже. Если ЗМ несвязный, определите из каких частей он состоит и их количество.\n\n{5;2}, {8;2}, {19;3}, {21;7}\nВ ответе запишите сначало тип зм(с - связный, нс - несвязный), количество составных частей(если зм несвязный) и количество углов у одной такой частм",
    "picture": "./pictures/task/sh.png",
    "answer": "С НС24 С НС73",
    "solve": "",
    "solve2": ""
  }
]